tested resource_dimension as well

```
  # nullplatform_dimension.component_dimension will be created
  + resource "nullplatform_dimension" "component_dimension" {
      + account   = "kwik-e-mart-main"
      + id        = (known after apply)
      + name      = "DepartmentTest"
      + namespace = "services-day-dic-2024"
      + nrn       = (known after apply)
      + order     = 3
      + slug      = (known after apply)
      + status    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dimension_status = (known after apply)
╷
│ Warning: Deprecated API Key Usage
│
│   with provider["registry.terraform.io/nullplatform/nullplatform"],
│   on resource.tf line 9, in provider "nullplatform":
│    9: provider "nullplatform" {
│
│ You are using the deprecated 'np_apikey'. Please update your configuration to use 'api_key' instead.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

nullplatform_dimension.component_dimension: Creating...
nullplatform_dimension.component_dimension: Creation complete after 3s [id=1131675813]
```